app/controllers/api/listings_controller.rb

SELECT "listings".* FROM "listings"
---
    def index
        if (bounds && params[:searchFilter] || params[:searchFilter])
            new_list = Listing.where(location_type: params[:searchFilter])
        elsif bounds
            new_list = Listing.in_bounds(bounds)
                # .group_by(:id)
        else
            new_list = Listing.all

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def show
        @listing = Listing.find(params[:id])
        @host = User.find(@listing.host_id)