app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ZOkBVC7B-nzYp8CJ9BllLA"], ["updated_at", "2019-05-29 04:26:57.716935"], ["id", 1]]
---
    def reset_token!
        self.update(session_token: User.generate_session_token)